wisteria-1c/Конфигурация/InformationRegisters/СвязиКонтрагентКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентКонтакт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязьНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРолей</Name>
					<Comment>Для представления в списках</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИнициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СвязиКонтрагентКонтакт/Forms/ИсторияСвязейСКонтактами/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Параметры.Свойство("Контрагент", ВладелецКонтрагент);
	
	Если ЗначениеЗаполнено(ВладелецКонтрагент) Тогда
		
		УстановитьОтборыСвязей(Справочники.КонтактныеЛица.ПустаяСсылка());
		
		// Контекстное открытие формы с отбором по контакту
		Элементы.Контрагент.Видимость = Ложь;
		
		Список.Параметры.УстановитьЗначениеПараметра("ОсновноеКонтактноеЛицоКонтрагента",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицо"));
			
		Список.Параметры.УстановитьЗначениеПараметра("Подписант",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицоПодписант"));
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", ВладелецКонтрагент);
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"КонтактНедействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.КонтактныеЛица);
	Элементы.ФормаГруппаОсновные.Доступность = МожноРедактировать;
	
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Контрагент" ИЛИ ИмяСобытия = "Запись_КонтактноеЛицо" Тогда
		ОбновитьСписок();
		Элементы.Список.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "УстановкаРеквизитаВыполнена" Тогда
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчик", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтоМобильныйКлиент Тогда
		ОбновитьОтображениеЭлементовДляВыбораКонтакта(Ложь);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",Элемент.ТекущиеДанные.Контакт);
	ПараметрыФормы.Вставить("ТекущийКонтрагент", ВладелецКонтрагент);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
		ДанныеСтроки = Элемент.ТекущиеДанные;
	ИначеЕсли ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	Иначе
		ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвязьНедействительна = ДанныеСтроки.ИндексПиктограммы = 1 ИЛИ ДанныеСтроки.ИндексПиктограммы = 2;
	
	Элементы.ИспользоватьКакОсновной.Доступность = Не ДанныеСтроки.ЭтоОсновноеКонтактноеЛицо
	И НЕ СвязьНедействительна И НЕ ДанныеСтроки.КонтактНедействителен;
	
	Элементы.ИспользоватьКакПодписанта.Доступность = Не ДанныеСтроки.ЭтоПодписант
	И НЕ СвязьНедействительна И НЕ ДанныеСтроки.КонтактНедействителен;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСвязиКонтактКонтрагент

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИспользоватьКакОсновной(Команда)
	
	ИнициализироватьЗаписьРеквизитаВладельца("КонтактноеЛицо");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакПодписанта(Команда)
	
	ИнициализироватьЗаписьРеквизитаВладельца("КонтактноеЛицоПодписант");
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущиеДанные) = ТипЗнч(Неопределено) 
		ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",Элементы.Список.ТекущиеДанные.Контакт);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)
	
	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, "КонтактНедействителен", Ложь, , , Не Элементы.ПоказыватьНедействительных.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено ИЛИ Элементы.Список.ТекущаяСтрока = Неопределено
		ИЛИ Элементы.Список.ПолучитьСтрокиДляОбработки().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоСмещения = Элементы.Список.ТекущаяСтрока;
	
	ПорядокЭлементовИзменен = ИзменитьПорядокЗаписей(Элементы.Список.ТекущиеДанные.Контрагент, 
		Элементы.Список.ТекущиеДанные.Контакт,
		-1,
		Элементы.ПоказыватьНедействительных.Пометка);
	
	Если НЕ ПорядокЭлементовИзменен Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = СтрокаДоСмещения;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено ИЛИ Элементы.Список.ТекущаяСтрока = Неопределено
		ИЛИ Элементы.Список.ПолучитьСтрокиДляОбработки().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоСмещения = Элементы.Список.ТекущаяСтрока;

	ПорядокЭлементовИзменен = ИзменитьПорядокЗаписей(Элементы.Список.ТекущиеДанные.Контрагент, 
		Элементы.Список.ТекущиеДанные.Контакт,
		1,
		Элементы.ПоказыватьНедействительных.Пометка);
	
	Если НЕ ПорядокЭлементовИзменен Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = СтрокаДоСмещения;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтакт(Команда)
	ВыбратьКонтактНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МобильныйКлиент

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	ОбновитьОтображениеЭлементовДляВыбораКонтакта(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьКонтактНаСервере()
	
	ОбновитьОтображениеЭлементовДляВыбораКонтакта(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеЭлементовДляВыбораКонтакта(ПоказатьВыбор)
	
	Элементы.Список.Видимость = ПоказатьВыбор;
	Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки.Видимость = ПоказатьВыбор;
	
	Элементы.ВыбратьКонтактМК.Видимость = Не ПоказатьВыбор;
	Элементы.ИсторияСвязей.Видимость = Не ПоказатьВыбор;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
		Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНаСервер = Новый Структура("Контакт,КонтактНедействителен,ИндексПиктограммы,ЭтоОсновноеКонтактноеЛицо,ЭтоПодписант");
	ЗаполнитьЗначенияСвойств(ДанныеНаСервер, Элементы.Список.ТекущиеДанные);
	СписокПриАктивизацииСтрокиНаСервере(ДанныеНаСервер);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(ДанныеНаСервер)
	
	УстановитьОтборыСвязей(ДанныеНаСервер.Контакт);
	
	Элементы.СвязьКонтактКонтрагент.ТекущаяСтрока = 1;
	
	КонтактНедействителен = ДанныеНаСервер.КонтактНедействителен;
	СвязьНедействительна = ДанныеНаСервер.ИндексПиктограммы = 1 ИЛИ ДанныеНаСервер.ИндексПиктограммы = 2;
	
	Элементы.ИспользоватьКакОсновной.Доступность = Не ДанныеНаСервер.ЭтоОсновноеКонтактноеЛицо
	И НЕ СвязьНедействительна И НЕ КонтактНедействителен;
	
	Элементы.ИспользоватьКакПодписанта.Доступность = Не ДанныеНаСервер.ЭтоПодписант
	И НЕ СвязьНедействительна И НЕ КонтактНедействителен;
	
	Элементы.ИсторияСвязей.Заголовок = СтрШаблон(
	НСтр("ru = 'История связей с контактом ""%1""'"), ДанныеНаСервер.Контакт);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьЗаписьРеквизитаВладельца(ИмяРеквизита)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		
		Или Элементы.Список.ТекущиеДанные = Неопределено
		
		Или (ИмяРеквизита = "КонтактноеЛицо"
			И Элементы.Список.ТекущиеДанные.ЭтоОсновноеКонтактноеЛицо)
		
		Или (ИмяРеквизита = "КонтактноеЛицоПодписант"
			И Элементы.Список.ТекущиеДанные.ЭтоПодписант)
			
	Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Если открыта форма контрагента, то изменение основного контактного лица выполняем в ней
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент",		ВладелецКонтрагент);
	СтруктураПараметров.Вставить("КонтактноеЛицо",	Элементы.Список.ТекущиеДанные.Контакт);
	СтруктураПараметров.Вставить("Реквизит", 		ИмяРеквизита);
	
	Оповестить("УстановкаКонтактногоЛица", СтруктураПараметров, ЭтотОбъект);
	
	// Обновим динамический список
	Если ЗначениеЗаполнено(ВладелецКонтрагент) Тогда
		
		СоответствиеПараметровСписка = Новый Соответствие;
		СоответствиеПараметровСписка.Вставить("КонтактноеЛицо",			"ОсновноеКонтактноеЛицоКонтрагента");
		СоответствиеПараметровСписка.Вставить("КонтактноеЛицоПодписант","Подписант");
		
		Список.Параметры.УстановитьЗначениеПараметра(СоответствиеПараметровСписка[ИмяРеквизита],
			СтруктураПараметров.КонтактноеЛицо);
		
	Иначе
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НовоеУсловноеОформлениеСписок = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформлениеСписок.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение = ЦветаПалитры.Серый;
	Оформление.Использование = Истина;
	
	Отбор = НовоеУсловноеОформлениеСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтактНедействителен");
	Отбор.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьПорядокЗаписей(Контрагент, Контакт, Смещение, ВключатьНедействительные)
	
	ПорядокИзменен = Ложь;
	
	РегистрыСведений.СвязиКонтрагентКонтакт.ИзменитьПорядок(Контрагент, Контакт, Смещение, ПорядокИзменен,
		ВключатьНедействительные);
	
	Возврат ПорядокИзменен;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписок()
	
	Список.Параметры.УстановитьЗначениеПараметра("ОсновноеКонтактноеЛицоКонтрагента",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицо"));
			
	Список.Параметры.УстановитьЗначениеПараметра("Подписант",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицоПодписант"));
			
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСвязей(Контакт)
	
	МассивОтбораКонтрагент = Новый Массив;
	МассивОтбораКонтрагент.Добавить(ВладелецКонтрагент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контрагент",
		МассивОтбораКонтрагент, ВидСравненияКомпоновкиДанных.ВСписке);
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(Контакт);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контакт",
		МассивОтбора, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#КонецОбласти
